Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPL_DFP/1.3.57/atdf/PIC32MM0016GPL036.atdf
         <register caption="" name="CNFA" offset="0x3b0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNFA" />
            <bitfield caption="" mask="0x00000002" name="CNFA" />
            <bitfield caption="" mask="0x00000004" name="CNFA" />
            <bitfield caption="" mask="0x00000008" name="CNFA" />
            <bitfield caption="" mask="0x00000010" name="CNFA" />
            <bitfield caption="" mask="0x00000200" name="CNFA" />
         </register>
         <register caption="" name="CNFB" offset="0x4b0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNFB" />
            <bitfield caption="" mask="0x00000002" name="CNFB" />
            <bitfield caption="" mask="0x00000004" name="CNFB" />
            <bitfield caption="" mask="0x00000008" name="CNFB" />
            <bitfield caption="" mask="0x00000010" name="CNFB" />
            <bitfield caption="" mask="0x00000020" name="CNFB" />
            <bitfield caption="" mask="0x00000040" name="CNFB" />
            <bitfield caption="" mask="0x00000080" name="CNFB" />
            <bitfield caption="" mask="0x00000100" name="CNFB" />
            <bitfield caption="" mask="0x00000200" name="CNFB" />
            <bitfield caption="" mask="0x00000400" name="CNFB" />
            <bitfield caption="" mask="0x00000800" name="CNFB" />
            <bitfield caption="" mask="0x00001000" name="CNFB" />
            <bitfield caption="" mask="0x00002000" name="CNFB" />
            <bitfield caption="" mask="0x00004000" name="CNFB" />
            <bitfield caption="" mask="0x00008000" name="CNFB" />
         </register>
         <register caption="" name="CNFC" offset="0x5b0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNFC" />
            <bitfield caption="" mask="0x00000002" name="CNFC" />
            <bitfield caption="" mask="0x00000004" name="CNFC" />
            <bitfield caption="" mask="0x00000008" name="CNFC" />
            <bitfield caption="" mask="0x00000100" name="CNFC" />
            <bitfield caption="" mask="0x00000200" name="CNFC" />
         </register>
         <register caption="" name="SR0A" offset="0x3c0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="SR0A" />
            <bitfield caption="" mask="0x00000002" name="SR0A" />
            <bitfield caption="" mask="0x00000004" name="SR0A" />
            <bitfield caption="" mask="0x00000008" name="SR0A" />
            <bitfield caption="" mask="0x00000010" name="SR0A" />
            <bitfield caption="" mask="0x00000200" name="SR0A" />
         </register>
         <register caption="" name="SR0B" offset="0x4c0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="SR0B" />
            <bitfield caption="" mask="0x00000002" name="SR0B" />
            <bitfield caption="" mask="0x00000004" name="SR0B" />
            <bitfield caption="" mask="0x00000008" name="SR0B" />
            <bitfield caption="" mask="0x00000010" name="SR0B" />
            <bitfield caption="" mask="0x00000020" name="SR0B" />
            <bitfield caption="" mask="0x00000040" name="SR0B" />
            <bitfield caption="" mask="0x00000080" name="SR0B" />
            <bitfield caption="" mask="0x00000100" name="SR0B" />
            <bitfield caption="" mask="0x00000200" name="SR0B" />
            <bitfield caption="" mask="0x00000400" name="SR0B" />
            <bitfield caption="" mask="0x00000800" name="SR0B" />
            <bitfield caption="" mask="0x00001000" name="SR0B" />
            <bitfield caption="" mask="0x00002000" name="SR0B" />
            <bitfield caption="" mask="0x00004000" name="SR0B" />
            <bitfield caption="" mask="0x00008000" name="SR0B" />
         </register>
         <register caption="" name="SR0C" offset="0x5c0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="SR0C" />
            <bitfield caption="" mask="0x00000002" name="SR0C" />
            <bitfield caption="" mask="0x00000004" name="SR0C" />
            <bitfield caption="" mask="0x00000008" name="SR0C" />
            <bitfield caption="" mask="0x00000100" name="SR0C" />
            <bitfield caption="" mask="0x00000200" name="SR0C" />
         </register>
         <register caption="" name="SR1A" offset="0x3d0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="SR1A" />
            <bitfield caption="" mask="0x00000002" name="SR1A" />
            <bitfield caption="" mask="0x00000004" name="SR1A" />
            <bitfield caption="" mask="0x00000008" name="SR1A" />
            <bitfield caption="" mask="0x00000010" name="SR1A" />
            <bitfield caption="" mask="0x00000200" name="SR1A" />
         </register>
         <register caption="" name="SR1B" offset="0x4d0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="SR1B" />
            <bitfield caption="" mask="0x00000002" name="SR1B" />
            <bitfield caption="" mask="0x00000004" name="SR1B" />
            <bitfield caption="" mask="0x00000008" name="SR1B" />
            <bitfield caption="" mask="0x00000010" name="SR1B" />
            <bitfield caption="" mask="0x00000020" name="SR1B" />
            <bitfield caption="" mask="0x00000040" name="SR1B" />
            <bitfield caption="" mask="0x00000080" name="SR1B" />
            <bitfield caption="" mask="0x00000100" name="SR1B" />
            <bitfield caption="" mask="0x00000200" name="SR1B" />
            <bitfield caption="" mask="0x00000400" name="SR1B" />
            <bitfield caption="" mask="0x00000800" name="SR1B" />
            <bitfield caption="" mask="0x00001000" name="SR1B" />
            <bitfield caption="" mask="0x00002000" name="SR1B" />
            <bitfield caption="" mask="0x00004000" name="SR1B" />
            <bitfield caption="" mask="0x00008000" name="SR1B" />
         </register>
         <register caption="" name="SR1C" offset="0x5d0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="SR1C" />
            <bitfield caption="" mask="0x00000002" name="SR1C" />
            <bitfield caption="" mask="0x00000004" name="SR1C" />
            <bitfield caption="" mask="0x00000008" name="SR1C" />
            <bitfield caption="" mask="0x00000100" name="SR1C" />
            <bitfield caption="" mask="0x00000200" name="SR1C" />
         </register>
      </register-group>
   </module>
