Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPL_DFP/1.3.57/atdf/PIC32MM0016GPL036.atdf
         <register caption="" name="IPTMR" offset="0x8bc0" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="IPTMR" />
         </register>
         <register caption="" name="IFS0" offset="0x8bd0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CTIF" />
            <bitfield caption="" mask="0x00000002" name="CS0IF" />
            <bitfield caption="" mask="0x00000004" name="CS1IF" />
            <bitfield caption="" mask="0x00000008" name="INT0IF" />
            <bitfield caption="" mask="0x00000010" name="INT1IF" />
            <bitfield caption="" mask="0x00000020" name="INT2IF" />
            <bitfield caption="" mask="0x00000040" name="INT3IF" />
            <bitfield caption="" mask="0x00000080" name="INT4IF" />
            <bitfield caption="" mask="0x00000100" name="CNAIF" />
            <bitfield caption="" mask="0x00000200" name="CNBIF" />
            <bitfield caption="" mask="0x00000400" name="CNCIF" />
            <bitfield caption="" mask="0x00000800" name="T1IF" />
            <bitfield caption="" mask="0x00001000" name="CMP1IF" />
            <bitfield caption="" mask="0x00002000" name="CMP2IF" />
            <bitfield caption="" mask="0x00004000" name="RTCCIF" />
            <bitfield caption="" mask="0x00008000" name="AD1IF" />
            <bitfield caption="" mask="0x00010000" name="CRCIF" />
            <bitfield caption="" mask="0x00020000" name="LVDIF" />
            <bitfield caption="" mask="0x00040000" name="CLC1IF" />
            <bitfield caption="" mask="0x00080000" name="CLC2IF" />
            <bitfield caption="" mask="0x00100000" name="SPI1EIF" />
            <bitfield caption="" mask="0x00200000" name="SPI1TXIF" />
            <bitfield caption="" mask="0x00400000" name="SPI1RXIF" />
            <bitfield caption="" mask="0x00800000" name="U1RXIF" />
            <bitfield caption="" mask="0x01000000" name="U1TXIF" />
            <bitfield caption="" mask="0x02000000" name="U1EIF" />
            <bitfield caption="" mask="0x20000000" name="CCP1IF" />
            <bitfield caption="" mask="0x40000000" name="CCT1IF" />
            <bitfield caption="" mask="0x80000000" name="CCP2IF" />
         </register>
         <register caption="" name="IFS1" offset="0x8be0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CCT2IF" />
            <bitfield caption="" mask="0x00000002" name="CCP3IF" />
            <bitfield caption="" mask="0x00000004" name="CCT3IF" />
            <bitfield caption="" mask="0x00000020" name="SPI2EIF" />
            <bitfield caption="" mask="0x00000040" name="SPI2TXIF" />
            <bitfield caption="" mask="0x00000080" name="SPI2RXIF" />
            <bitfield caption="" mask="0x00000100" name="U2RXIF" />
            <bitfield caption="" mask="0x00000200" name="U2TXIF" />
            <bitfield caption="" mask="0x00000400" name="U2EIF" />
            <bitfield caption="" mask="0x00004000" name="NVMIF" />
            <bitfield caption="" mask="0x00008000" name="CPCIF" />
         </register>
         <register caption="" name="IEC0" offset="0x8c50" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CTIE" />
            <bitfield caption="" mask="0x00000002" name="CS0IE" />
            <bitfield caption="" mask="0x00000004" name="CS1IE" />
            <bitfield caption="" mask="0x00000008" name="INT0IE" />
            <bitfield caption="" mask="0x00000010" name="INT1IE" />
            <bitfield caption="" mask="0x00000020" name="INT2IE" />
            <bitfield caption="" mask="0x00000040" name="INT3IE" />
            <bitfield caption="" mask="0x00000080" name="INT4IE" />
            <bitfield caption="" mask="0x00000100" name="CNAIE" />
            <bitfield caption="" mask="0x00000200" name="CNBIE" />
            <bitfield caption="" mask="0x00000400" name="CNCIE" />
            <bitfield caption="" mask="0x00000800" name="T1IE" />
            <bitfield caption="" mask="0x00001000" name="CMP1IE" />
            <bitfield caption="" mask="0x00002000" name="CMP2IE" />
            <bitfield caption="" mask="0x00004000" name="RTCCIE" />
            <bitfield caption="" mask="0x00008000" name="AD1IE" />
            <bitfield caption="" mask="0x00010000" name="CRCIE" />
            <bitfield caption="" mask="0x00020000" name="LVDIE" />
            <bitfield caption="" mask="0x00040000" name="CLC1IE" />
            <bitfield caption="" mask="0x00080000" name="CLC2IE" />
            <bitfield caption="" mask="0x00100000" name="SPI1EIE" />
            <bitfield caption="" mask="0x00200000" name="SPI1TXIE" />
            <bitfield caption="" mask="0x00400000" name="SPI1RXIE" />
            <bitfield caption="" mask="0x00800000" name="U1RXIE" />
            <bitfield caption="" mask="0x01000000" name="U1TXIE" />
            <bitfield caption="" mask="0x02000000" name="U1EIE" />
            <bitfield caption="" mask="0x20000000" name="CCP1IE" />
            <bitfield caption="" mask="0x40000000" name="CCT1IE" />
            <bitfield caption="" mask="0x80000000" name="CCP2IE" />
         </register>
         <register caption="" name="IEC1" offset="0x8c60" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CCT2IE" />
            <bitfield caption="" mask="0x00000002" name="CCP3IE" />
            <bitfield caption="" mask="0x00000004" name="CCT3IE" />
            <bitfield caption="" mask="0x00000020" name="SPI2EIE" />
            <bitfield caption="" mask="0x00000040" name="SPI2TXIE" />
            <bitfield caption="" mask="0x00000080" name="SPI2RXIE" />
            <bitfield caption="" mask="0x00000100" name="U2RXIE" />
            <bitfield caption="" mask="0x00000200" name="U2TXIE" />
            <bitfield caption="" mask="0x00000400" name="U2EIE" />
            <bitfield caption="" mask="0x00004000" name="NVMIE" />
            <bitfield caption="" mask="0x00008000" name="CPCIE" />
         </register>
         <register caption="" name="IPC0" offset="0x8cd0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="CTIS" />
            <bitfield caption="" mask="0x0000001C" name="CTIP" />
            <bitfield caption="" mask="0x00000300" name="CS0IS" />
            <bitfield caption="" mask="0x00001C00" name="CS0IP" />
            <bitfield caption="" mask="0x00030000" name="CS1IS" />
            <bitfield caption="" mask="0x001C0000" name="CS1IP" />
            <bitfield caption="" mask="0x03000000" name="INT0IS" />
            <bitfield caption="" mask="0x1C000000" name="INT0IP" />
         </register>
         <register caption="" name="IPC1" offset="0x8ce0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000003" name="INT1IS" />
            <bitfield caption="" mask="0x0000001C" name="INT1IP" />
            <bitfield caption="" mask="0x00000300" name="INT2IS" />
            <bitfield caption="" mask="0x00001C00" name="INT2IP" />
            <bitfield caption="" mask="0x00030000" name="INT3IS" />
            <bitfield caption="" mask="0x001C0000" name="INT3IP" />
            <bitfield caption="" mask="0x03000000" name="INT4IS" />
            <bitfield caption="" mask="0x1C000000" name="INT4IP" />
         </register>
